Revit 2024 API
Wave Members
The Wave type exposes the following members.
Properties
Name | Description
TextureAngle
 The property labeled "Angle" from the "Wave" schema.
TextureLinkTextureTransforms
 The property labeled "Link Transforms" from the "Wave" schema.
TextureRealWorldOffsetX
 The property labeled "Offset X" from the "Wave" schema.
TextureRealWorldOffsetY
 The property labeled "Offset Y" from the "Wave" schema.
TextureRealWorldOffsetZ
 The property labeled "Offset Z" from the "Wave" schema.
WaveAmplitude
 The property labeled "Amplitude" from the "Wave" schema.
WaveColor1
 The property labeled "Color 1" from the "Wave" schema.
WaveColor2
 The property labeled "Color 2" from the "Wave" schema.
WaveDistribution
 The property labeled "Distribution" from the "Wave" schema.
WaveNumWaveSets
 The property labeled "Number" from the "Wave" schema.
WavePhase
 The property labeled "Phase" from the "Wave" schema.
WaveRandomSeed
 The property labeled "Random Seed" from the "Wave" schema.
WaveWaveLenMax
 The property labeled "Len Max" from the "Wave" schema.
WaveWaveLenMin
 The property labeled "Len Min" from the "Wave" schema.
WaveWaveRadius
 The property labeled "Radius" from the "Wave" schema.
See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace